:PROPERTIES:
:ID: 2E53EE1A-6856-6904-7FEB-AC95C6722A63
:END:
#+title: Client Recipes
#+author: Marco Craveiro
#+options: <:nil c:nil todo:nil ^:nil d:nil date:nil author:nil toc:nil html-postamble:nil

Demonstrates all of the functionality available on the command line tool
=ores.client=.

* Recipes
  :PROPERTIES:
  :header-args: :exports both
  :header-args+: :results raw
  :header-args+: :dir ../../build/output/linux-clang-debug/publish/bin
  :END:

** Client
   :PROPERTIES:
   :header-args+: :var log_args="--log-enabled --log-level trace --log-directory ../log"
   :header-args+: :var ORES_CLIENT_LOGIN_PASSWORD=(auth-source-pick-first-password :host "localhost" :user "newuser3")
   :END:

*** Basic connect

#+name: basic-connect
#+begin_src ores-client
connect localhost 55555 test
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
./ores.client ${log_args} << 'EOF'
<<basic-connect>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
ORE Studio Client REPL v0.0.5
Type 'help' for available commands, 'exit' to quit

ores-client> ✓ Connected.
ores-client> Bye!
#+end_example

*** Auto connect
   :PROPERTIES:
   :header-args+: :var ORES_CLIENT_LOGIN_PASSWORD=(auth-source-pick-first-password :host "localhost" :user "ores")
   :header-args+: :var connect_args="--connect-host localhost --connect-port 55555 --connect-identifier recipes"
   :END:

#+name: auto-connect
#+begin_src ores-client
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
./ores.client ${log_args} ${connect_args} << 'EOF'
<<auto-connect>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Auto-connected to localhost:55555
ORE Studio Client REPL v0.0.5
Type 'help' for available commands, 'exit' to quit

ores-client> Bye!
#+end_example

*** Auto login
   :PROPERTIES:
   :header-args+: :var connect_args="--connect-host localhost --connect-port 55555 --connect-identifier recipes"
   :header-args+: :var login_args="--login-username newuser3"
   :END:

#+name: auto-login
#+begin_src ores-client
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_CLIENT_LOGIN_PASSWORD
./ores.client ${log_args} ${connect_args} ${login_args} << 'EOF'
<<auto-login>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Auto-connected to localhost:55555
✓ Auto-login successful!
  Username: newuser3
  Account ID: 019a5e49-476c-70ce-9909-3887cae700e9
  Admin: No
ORE Studio Client REPL v0.0.5
Type 'help' for available commands, 'exit' to quit

ores-client> Bye!
#+end_example

*** Create account
   :PROPERTIES:
   :header-args+: :var connect_args="--connect-host localhost --connect-port 55555 --connect-identifier recipes"
   :header-args+: :var login_args="--login-username newuser3"
   :END:

#+name: create-account
#+begin_src ores-client
accounts create newuser10 123 567 newuser10@example.com 1
accounts create newuser11 123 567 newuser11@example.com 1
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_CLIENT_LOGIN_PASSWORD
./ores.client ${log_args} ${connect_args} ${login_args}  << 'EOF'
<<create-account>>
EOF
#+END_SRC

#+RESULTS:
#+begin_example
✓ Auto-connected to localhost:55555
✓ Auto-login successful!
  Username: newuser3
  Account ID: 019a5e49-476c-70ce-9909-3887cae700e9
  Admin: No
ORE Studio Client REPL v0.0.5
Type 'help' for available commands, 'exit' to quit

ores-client>
✓ Account created with ID: 019a9ea8-c265-7046-96d2-42dd4c53a662
ores-client>
✓ Account created with ID: 019a9ea8-c33a-7fdc-936f-1f0723c12679
ores-client>
Bye!
#+end_example

* Footer

| Previous: [[id:46F5ED07-9E63-77B4-2783-E0147EFF45D0][Recipes]] |

# Local Variables:
# eval: (whitespace-mode -1)
# End:
